Documents/Тренировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Тренировка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьТренировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоТренировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Упражнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Упражнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упражнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПодходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислоПовторений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Тренировка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УпражненияВыполненоПриИзменении(Элемент)
	
	Если Элементы.Упражнения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Упражнения.ТекущиеДанные.Выполнено Тогда
		ПараметрыФормы = Новый Структура("Упражнение",Элементы.Упражнения.ТекущиеДанные.Упражнение);
		ОткрытьФорму("Обработка.ВыполнениеУпражнения.Форма.Форма", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОкончанияУпражнения" Тогда
		ЗаполнитьТаблицуУпражнений(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУпражнений(Параметр)
	
	ПараметрыОтбора = Новый Структура("Упражнение",Параметр.Упражнение);
	МассПоиска = Объект.Упражнения.НайтиСтроки(ПараметрыОтбора);
	
	Объект.ПродолжительностьТренировки =  Объект.ПродолжительностьТренировки + Параметр.ВремяВыполнения; 
	
	Для Каждого ТекЭл Из МассПоиска Цикл		
		ТекЭл.КоличествоПодходов = Параметр.КоличествоПодходов;
		ТекЭл.ЧислоПовторений = Параметр.ЧислоПовторений;
		ТекЭл.Вес = Параметр.Вес;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьМестоположение(Команда)
	
	ОпределитьТекущиеГеокоординаты(Объект.МестоТренировки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьТекущиеГеокоординаты(ТекущееМестоположение) Экспорт

    #Если МобильноеПриложениеКлиент Тогда

        ТекущийПровайдер = "gps";
        Попытка
            ДМ = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ТекущийПровайдер);
        Исключение
            ДМ = Неопределено;
        КонецПопытки;

        Если ДМ = Неопределено Тогда
            ТекущийПровайдер = "network";
            Попытка
                ДМ = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ТекущийПровайдер);
           Исключение
                ДМ = Неопределено;
            КонецПопытки;
        КонецЕсли;

        Если ДМ = Неопределено Тогда
            Возврат;
        КонецЕсли;

        Если ТекущаяДата() - МестноеВремя(ДМ.Дата) > 300 Тогда
            СредстваГеопозиционирования.ОбновитьМестоположение(ТекущийПровайдер, 5);
            ДМ = СредстваГеопозиционирования.ПолучитьПоследнееМестоположение(ТекущийПровайдер);
        КонецЕсли;

        ДА = ПолучитьАдресПоМестоположению(ДМ.Координаты);
        Если ДА = Неопределено Тогда
            ТекущееМестоположение =  "Lat: " + ДМ.Координаты.Широта + ", Lon: " + ДМ.Координаты.Долгота;
        Иначе
            ТекущееМестоположение = СтрЗаменить(ДА.Представление, Символы.ПС, ", ");
        КонецЕсли;

        ТекущееМестоположение = ТекущееМестоположение + "Date: " + МестноеВремя(ДМ.Дата) + ", Provider: " + ТекущийПровайдер;
        	
	#Иначе	
		
    #КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.УпражненияВыполнено.Видимость = Ложь;
		Элементы.УпражненияУпражнение1.Видимость = Истина;
		Элементы.УпражненияУпражнение.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда
		Объект.Дата = Параметры.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УпражненияУпражнение1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Упражнения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Упражнения.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("Упражнение,КоличествоПодходов,ЧислоПовторений,Вес",ТекДанные.Упражнение,ТекДанные.КоличествоПодходов,ТекДанные.ЧислоПовторений,ТекДанные.Вес);
	ОткрытьФорму("Документ.Тренировка.Форма.ФормаПосмотраУпражнений", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыОтбора = Новый Структура("Выполнено",Ложь);
	МасПоиска = ТекущийОбъект.Упражнения.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого ТекЭл Из МасПоиска Цикл
			ТекущийОбъект.Упражнения.Удалить(ТекЭл);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновлениеФормы");
	
КонецПроцедуры
